[
    {
        "id": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/N7K0Wbm/pngwing-1.png",
        "review": "The Great Gatsby is a masterpiece that delves deep into the decadence, extravagance, and disillusionment of the Jazz Age. F. Scott Fitzgerald weaves a captivating tale of love, ambition, and tragedy through the eyes of the enigmatic Jay Gatsby. Set against the backdrop of lavish parties and opulent mansions on Long Island's Gold Coast, this novel offers a poignant critique of the American Dream. With lyrical prose and intricate character development, Fitzgerald paints a vivid portrait of a society obsessed with wealth and status, where moral decay lurks beneath the surface of glittering façades.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Fiction",
        "tags": [
            "Romance",
            "Drama"
        ],
        "publisher": "Scribner",
        "yearOfPublishing": 1925,
        "price": 12.99
    },
    {
        "id": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/vLBbFQF/book2.png",
        "review": "1984 is a haunting and prophetic novel that offers a chilling portrayal of a dystopian society ruled by totalitarianism. George Orwell's visionary work paints a bleak picture of a future where individual freedoms are eradicated, and thought is controlled by a powerful regime. Through the eyes of the protagonist, Winston Smith, Orwell explores themes of surveillance, propaganda, and resistance. This thought-provoking masterpiece serves as a stark warning against the dangers of authoritarianism and the manipulation of truth. With its powerful narrative and compelling characters, 1984 remains a timeless classic that resonates with readers across generations.",
        "totalPages": 328,
        "rating": 3.7,
        "category": "Fiction",
        "tags": [
            "Dystopian",
            "Political"
        ],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949,
        "price": 10.99
    },
    {
        "id": 3,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/bzQfpDF/book3.png",
        "review": "To Kill a Mockingbird is a timeless and powerful novel that addresses themes of racial injustice, moral growth, and empathy. Harper Lee's poignant narrative unfolds through the innocent eyes of Scout Finch, a young girl growing up in the racially segregated South. The story revolves around the trial of Tom Robinson, a black man falsely accused of raping a white woman, and the moral integrity of lawyer Atticus Finch, Scout's father, who defends him. Through compelling characters and evocative storytelling, Lee challenges societal norms and prejudices, urging readers to confront the complexities of human nature and strive for justice and compassion.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": [
            "Social Justice",
            "Coming-of-Age"
        ],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960,
        "price": 11.50
    },
    {
        "id": 4,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/hY9Xvf3/book4.png",
        "review": "The Catcher in the Rye is an iconic novel that captures the angst, alienation, and disillusionment of adolescence with raw honesty and authenticity. J.D. Salinger's protagonist, Holden Caulfield, is a disenchanted teenager navigating the complexities of growing up in a world he perceives as phony and superficial. Through Holden's introspective journey in New York City, Salinger explores themes of identity, isolation, and the search for meaning in a conformist society. With its unique narrative voice and memorable characters, The Catcher in the Rye has resonated with readers for decades, making it a classic coming-of-age story that continues to inspire and provoke thought.",
        "totalPages": 277,
        "rating": 4.4,
        "category": "Fiction",
        "tags": [
            "Coming-of-Age",
            "American Literature"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951,
        "price": 9.99
    },
    {
        "id": 5,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/4jY27Q4/book5.png",
        "review": "Pride and Prejudice is a witty and insightful novel that offers a charming and satirical glimpse into the world of 19th-century English society. Jane Austen's timeless classic revolves around the spirited Elizabeth Bennet and the proud Mr. Darcy, whose initial prejudices and misunderstandings give way to mutual respect and love. Through sparkling dialogue, social commentary, and delightful character dynamics, Austen explores themes of love, marriage, class, and personal growth. With its enduring appeal and universal themes, Pride and Prejudice continues to captivate readers with its vibrant characters, engaging plot, and richly detailed portrayal of Regency-era England.",
        "totalPages": 432,
        "rating": 4.6,
        "category": "Fiction",
        "tags": [
            "Romance",
            "Satire"
        ],
        "publisher": "T. Egerton",
        "yearOfPublishing": 1813,
        "price": 8.50
    },
    {
        "id": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/HTmTLdd/book6.png",
        "review": "The Hobbit is a captivating adventure that transports readers to a magical world filled with dragons, wizards, and unforgettable characters. J.R.R. Tolkien's enchanting tale follows the humble hobbit Bilbo Baggins as he embarks on an epic quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters elves, dwarves, and a mysterious creature named Gollum, testing his courage and resourcefulness. With its richly imagined setting, intricate mythology, and timeless themes of heroism, friendship, and redemption, The Hobbit has earned its place as a beloved classic of fantasy literature that continues to inspire readers of all ages.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": [
            "Adventure",
            "Epic"
        ],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937,
        "price": 14.99
    }
]